tutorials/rasCavitatingFoam/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="rasCavitatingFoam"

refineMeshByCellSet()
{
    echo "creating cell set for primary zone - $1"
    cp system/cellSetDict.$1 system/cellSetDict
    cellSet >& log.cellSet.$1

    echo "refining primary zone - $1"
    refineMesh -dict >& log.refineMesh.$1
    rm -rf 0/polyMesh
    mv 1e-08/polyMesh 0/
    rm -rf 1e-08
}

runApplication blockMesh

refineMeshByCellSet 1

refineMeshByCellSet 2

refineMeshByCellSet 3

runApplication $application
